---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlacePathReinforcementWarn
source: html/e6b54e9c-c7a6-162b-806e-83517c4c60d8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlacePathReinforcementWarn Property

Can't find a host for Path Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlacePathReinforcementWarn { get; }
```